In [1]:
import pandas as pd
import numpy as np

### 1. Write a Pandas program to get the powers of an array values element-wise. 
Note: First array elements raised to powers from second array

In [2]:
data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df1 = pd.DataFrame(data)
df1

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels. Go to the editor
Sample Python dictionary data and list labels:

In [3]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2 = pd.DataFrame(exam_data, index = labels)
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data. Go to the editor

In [4]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

### 4. Write a Pandas program to get the first 3 rows of a given DataFrame

In [5]:
df2.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [6]:
df2[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

### 6. Write a Pandas program to select the specified columns and rows from a given data frame.

In [7]:
print("Select specific columns and rows:")
print(df2.iloc[[1, 3, 5, 6], [1, 3]])

Select specific columns and rows:
   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

### 7. Write a Pandas program to select rows where the number of attempts in the examination is greater than 2.

In [8]:
print("the number of attempts in the examination is greater than 2")
print(df2[df2['attempts']>2])

the number of attempts in the examination is greater than 2
      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

### 8. Write a Pandas program to count the number of rows and columns of a DataFrame

In [9]:
print('No. of Rows in Dataset:', df2.shape[0])
print('No. of columns in Dataset:', df2.shape[1])

No. of Rows in Dataset: 10
No. of columns in Dataset: 4

### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [10]:
print("select the rows where the score is missing, i.e. is NaN")
print(df2[df2['score'].isna()])

select the rows where the score is missing, i.e. is NaN
    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [11]:
df2[df2['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [12]:
df2[(df2['attempts']<2) & (df2['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

### 12. Write a Pandas program to change the score in row 'd' to 11.5.

In [13]:
df2.iloc[3,1]=11.5

In [14]:
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [15]:
df2.iloc[3,1]=np.nan

### 13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [16]:
df2['attempts'].sum()

19

### 14. Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [17]:
df2['score'].mean()

13.5625

### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [18]:
Values = {'name':['Suresh'], 'score':[15.5], 'attempts':[1], 'qualify': ['yes'], 'label':['k']}

newdf = pd.DataFrame(Values)
newdf.set_index('label', inplace=True)
newdf

         name  score  attempts qualify
label
k      Suresh   15.5         1     yes

In [19]:
df2.append(newdf)
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [20]:
df2.loc['k'] = ['Suresh',15.5, 1,'yes']
print(df2)
df2.drop('k', inplace=True)
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [21]:
df2.sort_values(by =['name','score'], ascending=[False,True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

### 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [22]:
print(df2)
df2['qualify'].replace(['yes','no'], ['True','False'])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

a     True
b    False
c     True
d    False
e    False
f     True
g     True
h    False
i    False
j     True
Name: qualify, dtype: object

In [23]:
#Same Thing Using Map
df2['qualify'] = df2['qualify'].map({'yes': True, 'no': False})
df2

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

### 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [24]:

df2['name'] = df2['name'].replace('James','Suresh')
df2

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

### 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [25]:
df2.drop('attempts', axis=1)

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

### 20. Write a Pandas program to insert a new column in existing DataFrame.

In [26]:
new_column = np.arange(len(df2))
new_column
df2['new_column'] = new_column
df2

        name  score  attempts  qualify  new_column
a  Anastasia   12.5         1     True           0
b       Dima    9.0         3    False           1
c  Katherine   16.5         2     True           2
d     Suresh    NaN         3    False           3
e      Emily    9.0         2    False           4
f    Michael   20.0         3     True           5
g    Matthew   14.5         1     True           6
h      Laura    NaN         1    False           7
i      Kevin    8.0         2    False           8
j      Jonas   19.0         1     True           9

### 21. Write a Pandas program to iterate over rows in a DataFrame.

In [27]:
for i in df2.iterrows():
    print(i[1][0])

Anastasia
Dima
Katherine
Suresh
Emily
Michael
Matthew
Laura
Kevin
Jonas

### 22. Write a Pandas program to get list from DataFrame column headers.

In [28]:
for i in df2:
    print(i)

name
score
attempts
qualify
new_column

In [29]:
df2.columns

Index(['name', 'score', 'attempts', 'qualify', 'new_column'], dtype='object')

### 23. Write a Pandas program to rename columns of a given DataFrame

In [34]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
print(d.keys())
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df.columns = ['Column1', 'Column2', 'Column3']

#df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
df

dict_keys(['col1', 'col2', 'col3'])
Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

### 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [35]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('Rows for colum1 value == 4')
print(df.loc[df['col1'] == 4])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

### 25. Write a Pandas program to change the order of a DataFrame columns.

In [52]:
print(list(df2.columns.sort_values()))
df2 = df2[list(df2.columns.sort_values())]
df2

['attempts', 'name', 'new_column', 'qualify', 'score']

   attempts       name  new_column  qualify  score
a         1  Anastasia           0     True   12.5
b         3       Dima           1    False    9.0
c         2  Katherine           2     True   16.5
d         3     Suresh           3    False    NaN
e         2      Emily           4    False    9.0
f         3    Michael           5     True   20.0
g         1    Matthew           6     True   14.5
h         1      Laura           7    False    NaN
i         2      Kevin           8    False    8.0
j         1      Jonas           9     True   19.0

### 26. Write a Pandas program to add one row in an existing DataFrame.

In [53]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('After add one row:')
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df = df.append(df2, ignore_index=True)
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
After add one row:
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

### 27. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [57]:
df.to_csv("test.csv", sep="\t", index=False)

### 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [66]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1
g1 = df1.groupby(['city']).size().reset_index(name='Number of people')
g1

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

### 29. Write a Pandas program to delete DataFrame row(s) based on given column value.

In [67]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df = df[df.col2 != 5]
print("New DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

### 30. Write a Pandas program to widen output display to see more columns.

In [86]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

### 31. Write a Pandas program to select a row of series/dataframe by given integer index.

In [87]:
print(df.iloc[[2]], type(df.iloc[[2]]))
print(df.iloc[2], type(df.iloc[2]))

   col1  col2  col3
2     3     6     9 <class 'pandas.core.frame.DataFrame'>
col1    3
col2    6
col3    9
Name: 2, dtype: int64 <class 'pandas.core.series.Series'>

### 32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [93]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.fillna(0, inplace=True)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

### 33. Write a Pandas program to convert index in a column of the given dataframe.

In [94]:
df.reset_index( inplace=True)
df.to_string(index=False)
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    0.0         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    0.0         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

### 34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [108]:
print(df.at[9, 'score'])  ##Access a single value for a row/column label pair.
print(df.iat[9, 2]) ##Access a single value for a row/column pair by integer position.

19.0
19.0

### 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [116]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
print("\nNumber of NaN values in one or more columns:")
df.isnull().sum()

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Number of NaN values in one or more columns:

name        0
score       2
attempts    0
qualify     0
dtype: int64

### 36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [117]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(d)
print("Original DataFrame")
print(df)
print("New DataFrame after removing 2nd & 4th rows:")
df = df.drop(df.index[[2,4]])
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame after removing 2nd & 4th rows:
   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

### 37. Write a Pandas program to reset index in a given DataFrame.

In [119]:
df.reset_index(drop=True)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     4     7     0

### 38. Write a Pandas program to divide a DataFrame in a given ratio.

In [120]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

Original DataFrame:
          0         1
0  0.794894  0.932175
1 -0.387576  1.875176
2 -1.325034  0.740853
3  1.025106  0.280894
4  0.145139  0.866320
5 -1.196826 -0.092622
6 -0.344712  0.049759
7 -1.353329 -0.533425
8  0.249792 -0.022519
9  0.426817 -1.638752

70% of the said DataFrame:
          0         1
8  0.249792 -0.022519
2 -1.325034  0.740853
5 -1.196826 -0.092622
6 -0.344712  0.049759
3  1.025106  0.280894
1 -0.387576  1.875176
0  0.794894  0.932175

30% of the said DataFrame:
          0         1
4  0.145139  0.866320
7 -1.353329 -0.533425
9  0.426817 -1.638752

### 39. Write a Pandas program to combining two series into a DataFrame.

In [127]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print("Data Series:")
#print(s1)
#print(s2)
df = pd.concat([s1, s2], axis=0)
print("New DataFrame combining two series:")
print(df.reset_index())

Data Series:
New DataFrame combining two series:
   index       0
0      0     100
1      1     200
2      2  python
3      3  300.12
4      4     400
5      0      10
6      1      20
7      2     php
8      3   30.12
9      4      40

### 40. Write a Pandas program to shuffle a given DataFrame rows.

In [247]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(exam_df)
exam_df = exam_df.sample(frac=1,random_state=50)
print("\nNew DataFrame:")
print(exam_df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

New DataFrame:
        name  score  attempts qualify
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
6    Matthew   14.5         1     yes
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
1       Dima    9.0         3      no
5    Michael   20.0         3     yes
3      James    NaN         3      no
9      Jonas   19.0         1     yes
0  Anastasia   12.5         1     yes

### 41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [151]:
s = pd.DataFrame({'Date':['3/11/2000', '3/12/2000', '3/13/2000']})
print("String Date:")
print(s)
r = pd.to_datetime(s['Date'])
print("Original DataFrame (string to datetime):")
r

String Date:
        Date
0  3/11/2000
1  3/12/2000
2  3/13/2000
Original DataFrame (string to datetime):

0   2000-03-11
1   2000-03-12
2   2000-03-13
Name: Date, dtype: datetime64[ns]

### 42. Write a Pandas program to rename a specific column name in a given DataFrame.

In [152]:
s.rename(columns= {'Date':'Dates'}, inplace=True)
s

       Dates
0  3/11/2000
1  3/12/2000
2  3/13/2000

### 43. Write a Pandas program to get a list of a specified column of a DataFrame.

In [157]:
print(df['name'].tolist())
list(df['attempts'])

['Laura', 'Kevin', 'Matthew', 'Katherine', 'Emily', 'Dima', 'Michael', 'James', 'Jonas', 'Anastasia']

[1, 2, 1, 2, 2, 3, 3, 3, 1, 1]

### 44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

In [169]:
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = np.zeros(15, dtype=dtype)
values
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pd.DataFrame(values,index=index)
df

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

In [199]:
index = ['inx'+str(i) for i in range(2,len(arr1)+2)]
arr1 = pd.Series(np.arange(10,100,10))
arr2 = pd.Series(np.arange(100,1000,100))
arr3 = pd.Series(np.arange(1000,10000,1000))
print(data)
print(type(data))
df=pd.concat([arr1,arr2,arr3],axis=0)

    0    1     2
0  10  100  1000
1  20  200  2000
2  30  300  3000
3  40  400  4000
4  50  500  5000
5  60  600  6000
6  70  700  7000
7  80  800  8000
8  90  900  9000
<class 'pandas.core.frame.DataFrame'>

### 45. Write a Pandas program to find the row for where the value of a given column is maximum.

In [209]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("Row where col1 has maximum value:")
print(df['col1'].argmax(), df.iloc[[df['col1'].argmax()],[0,1,2]])
print("Row where col2 has maximum value:")
print(df['col2'].argmax(), df.iloc[[df['col2'].argmax()],[0,1,2]])
print("Row where col3 has maximum value:")
print(df['col3'].argmax(), df.iloc[[df['col3'].argmax()],[0,1,2]])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4    col1  col2  col3
4     7     5    11
Row where col2 has maximum value:
3    col1  col2  col3
3     4     9     1
Row where col3 has maximum value:
2    col1  col2  col3
2     3     6    12

### 46. Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [210]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
if 'col4' in df.columns:
  print("Col4 is present in DataFrame.")
else:
  print("Col4 is not present in DataFrame.")
if 'col1' in df.columns:
  print("Col1 is present in DataFrame.")
else:
  print("Col1 is not present in DataFrame.")

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Col4 is not present in DataFrame.
Col1 is present in DataFrame.

### 47. Write a Pandas program to get the specified row value of a given DataFrame.

In [213]:
print("Values of Row1")
print(df.iloc[0])
print("Values of Row4")
print(df.iloc[3])

Values of Row1
col1    1
col2    4
col3    7
Name: 0, dtype: int64
Values of Row4
col1    4
col2    9
col3    1
Name: 3, dtype: int64

### 48. Write a Pandas program to get the datatypes of columns of a DataFrame.

In [221]:
exam_df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

### 49. Write a Pandas program to append data to an empty DataFrame.

In [224]:
empty_df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
empty_df = empty_df.append(data)
empty_df

   col1  col2
0     0     0
1     1     1
2     2     2

### 50. Write a Pandas program to sort a given DataFrame by two or more columns.

In [231]:
exam_df.sort_values(['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes

### 51. Write a Pandas program to convert the datatype of a given column (floats to ints).

In [248]:
print(exam_df.dtypes)
exam_df.score.fillna(0, inplace=True)
exam_df.score = exam_df.score.astype(int)
exam_df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

name        object
score        int32
attempts     int64
qualify     object
dtype: object

### 52. Write a Pandas program to remove infinite values from a given DataFrame.

In [249]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

### 53. Write a Pandas program to insert a given column at a specific column index in a DataFrame.

In [250]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
print("\nNew DataFrame")
print(df)

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

New DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

### 54. Write a Pandas program to convert a given list of lists into a Dataframe.

In [251]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
# sets the headers as list
headers = my_lists.pop(0) 
print("Original list of lists:")
print(my_lists)
df = pd.DataFrame(my_lists, columns = headers)
print("New DataFrame")
print(df)

Original list of lists:
[[2, 4], [1, 3]]
New DataFrame
   col1  col2
0     2     4
1     1     3

### 55. Write a Pandas program to group by the first column and get second column as lists in rows.

In [252]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
print(df)
df = df.groupby('col1')['col2'].apply(list)
print("\nGroup on the col1:")
print(df)

Original DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

Group on the col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

### 56. Write a Pandas program to get column index from column name of a given DataFrame.

In [261]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nIndex of 'col2'")
print(df.columns.get_loc("col2"))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Index of 'col2'
1

### 57. Write a Pandas program to count number of columns of a DataFrame.

In [262]:
df.shape[1]

3

### 58. Write a Pandas program to select all columns, except one given column in a DataFrame.

In [263]:
df = df.loc[:,df.columns!='col2']
df

   col1  col3
0     1     7
1     2     8
2     3    12
3     4     1
4     7    11

### 59. Write a Pandas program to get first n records of a DataFrame.

In [266]:
df.head(3)

   col1  col3
0     1     7
1     2     8
2     3    12

### 60. Write a Pandas program to get last n records of a DataFrame.

In [267]:
df.tail(3)

   col1  col3
2     3    12
3     4     1
4     7    11

### 61. Write a Pandas program to get topmost n records within each group of a DataFrame.

In [268]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\ntopmost n records within each group of a DataFrame:")
df1 = df.nlargest(3, 'col1')
print(df1)
df2 = df.nlargest(3, 'col2')
print(df2)
df3 = df.nlargest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

### 62. Write a Pandas program to remove first n rows of a given DataFrame.

In [269]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nAfter removing first 3 rows of the said DataFrame:")
df1 = df.iloc[3:]
print(df1)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

After removing first 3 rows of the said DataFrame:
   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

### 63. Write a Pandas program to remove last n rows of a given DataFrame.

In [270]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nAfter removing first 3 rows of the said DataFrame:")
df1 = df.iloc[:3]
print(df1)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

After removing first 3 rows of the said DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

### 64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [271]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nAdd prefix:")
print(df.add_prefix("A_"))
print("\nAdd suffix:")
print(df.add_suffix("_1"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

### 65. Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [272]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nReverse column order:")
print(df.loc[:, ::-1])
print("\nReverse row order:")
print(df.loc[::-1])
print("\nReverse row order and reset index:")
print(df.loc[::-1].reset_index(drop = True))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Reverse column order:
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

Reverse row order:
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Reverse row order and reset index:
    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

### 66. Write a Pandas program to select columns by data type of a given DataFrame.

In [273]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
print("\nSelect numerical columns")
print(df.select_dtypes(include = "number"))
print("\nSelect string columns")
print(df.select_dtypes(include = "object"))

Original DataFrame
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

Select numerical columns
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

Select string columns
             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

### 67. Write a Pandas program to split a given DataFrame into two random subsets.

In [274]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': ['18', '21', '22', '22', '23']
})

df_1 = df.sample(frac = 0.6)
df_2 = df.drop(df_1.index)
print("Original Dataframe and shape:")
print(df)
print(df.shape)
print("\nSubset-1 and shape:")
print(df_1)
print(df_1.shape)
print("\nSubset-2 and shape:")
print(df_2)
print(df_2.shape)

Original Dataframe and shape:
             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23
(5, 3)

Subset-1 and shape:
             name date_of_birth age
3    Eesha Hinton    11/05/2002  22
0  Alberto Franco    17/05/2002  18
4    Syed Wharton    15/09/1997  23
(3, 3)

Subset-2 and shape:
           name date_of_birth age
1  Gino Mcneill    16/02/1999  21
2   Ryan Parkes    25/09/1998  22
(2, 3)

### 68. Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [275]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
print(df)
df.columns = df.columns.str.lower().str.rstrip()
print("\nRemove trailing (at the end) whitesapce and convert to lowercase of the columns name")
print(df.head())

Original DataFrame
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Remove trailing (at the end) whitesapce and convert to lowercase of the columns name
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

### 69. Write a Pandas program to merge datasets and check uniqueness.

In [276]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
print(df)
print(df1)
print('\n"one_to_one”: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
print('\n"one_to_many” or “1:m”: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
print('“many_to_one” or “m:1”: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

New DataFrames:
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

"one_to_one”: check if merge keys are unique in both left and right datasets:"
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many” or “1:m”: check if merge keys are unique in left dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0
“many_to_one” or “m:1”: check if merge keys are unique in right dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

### 70. Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

In [277]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
print("Original DataFrame:")
print(df)
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(df["age_groups"])

Original DataFrame:
             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

Age group:
0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): [kids < adult < elderly]

### 71. Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

In [278]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nGlobal usage of memory of the DataFrame:")
print(df.info(memory_usage = "deep"))
print("\nThe usage of memory of every column of the said DataFrame:")
print(df.memory_usage(deep = True))

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Global usage of memory of the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Date_Of_Birth   5 non-null      object
 2   Age             5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes
None

The usage of memory of every column of the said DataFrame:
Index             128
Name              346
Date_Of_Birth     335
Age                40
dtype: int64

### 72. Write a Pandas program to combine many given series to create a DataFrame.

In [280]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Original Series:")
print(sr1)
print(sr2)
print("Combine above series to a dataframe:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())
print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())
print("\nUsing pandas DataFrame with a dictionary, gives a specific name to the columns:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))

Original Series:
0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64
Combine above series to a dataframe:
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

Using pandas concat:
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

Using pandas DataFrame with a dictionary, gives a specific name to the columns:
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

### 73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [281]:
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:

C:\Users\Lenovo\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
x1rNBJsX9h -1.264562 -0.444107 -0.514328  0.407418
VetqrOPa64  1.992329 -1.287156 -1.313195  1.251505
xgnkCbyHqE -0.657135  0.237045  0.593069 -1.369619
lxc8peljjx -1.570314 -0.798328 -0.541928 -0.255454
nZm6x5numO  0.766272  0.013796  0.344962 -0.206351
aLKHWSyyGM  0.301962  0.952684 -0.428587  0.122159
Beg6DuIfs0  0.367895 -1.691533  0.453453 -0.411476
XVdZ3QztCJ -0.268069  0.480757 -0.504340  1.437186
qmVsT7qwMY  0.575604 -0.138231  0.475317  0.758114
iqPZd4A4qn  0.400908  0.536845  0.231815 -0.618346
vabXma6QdV -1.781135 -0.675051  1.309425 -2.331486
MpjdMRx5hP -0.693735  0.402513  0.469239 -1.042389
mhCjXOW3Sx  0.249971 -1.940499  0.182350  0.175215
LFy8W7BA0L -1.814587  2.333957 -0.161988  0.507174
3ATy4klOe9  0.286743  0.053004  1.823912 -0.210899
jkizRxv2MG  0.861397 -0.631612 -0.925267 -0.308843
NH1FmFyAxv -0.343420 -0.336650  0.025118  1.951304
TkxUMpXATR  0.346036  0.913518  0.287096 -0.296485
aj1yqwYeFi  0.116306  0.901253  0.573480 -1.720817
5BSc39mxTV -1.606396  1.932555  0.510617  0.323355
Bsg4Qpt0vO  0.476500 -0.455729 -0.449439 -0.235811
NP8pfQAk1E -0.314765 -0.426471 -0.865238 -1.223978
zsKzzcjTu1  1.268651  0.778289  0.412536  0.588169
Rdn44wf3oU  0.465748 -0.028406  0.983777 -0.672140
cszBgj8ewh -1.545406  0.009859  0.650252  0.027247
iRIC1W0v2N -0.237100  1.019026  0.382723  0.298397
tkAPW9J7C2 -0.807147  1.226947  0.047452  1.723534
hxFY9y7yTM -0.005037 -0.540227  0.400271  0.695951
w59o3rYjKg -1.706368 -0.535375 -1.056635 -1.480386
NjN23uXiqN  0.262983  0.733414 -0.138455  0.091498

DataFrame: Contains missing values:
                   A         B         C         D
1jFSEqBtfO  0.014144 -0.572554 -0.615076 -1.318353
q8fXnNaVTq  0.103771 -0.933330 -0.632716  0.311965
zbyHXdVoF1  0.347569 -1.894322       NaN  2.548807
mqPceHgU6Y  1.127594 -1.707551 -0.185034  0.299437
Xtw0ELvv5v       NaN  1.563522 -0.089074  0.013172
sTczafaQ2k -0.350467  1.331419 -1.653170  1.409297
ZQGajHGqD0       NaN  0.912037       NaN -0.308009
BSTpjFz73y       NaN -1.562497 -0.885030  0.260406
nuk4saAHbQ  0.530382  0.665105  0.591514       NaN
uS39fZLwn6 -0.566957  0.862138  0.234164  0.610551
jUYXi17yTd -2.229055 -0.088072       NaN -1.468329
jv9BjEamX3  0.530000  0.524501  0.404923 -0.627064
5SaJ8mUXi0 -0.708019 -0.602030 -1.585593 -0.676954
MZSZw6vZfb  0.023558 -1.070178 -0.086772 -1.514476
xgKLQyHzup -1.306722  0.637217  0.457286 -0.025505
YKxuw3Q2Nx -1.659563       NaN -1.281709 -0.475085
2yc4QcEHBG  1.130505  0.917367 -1.108026 -1.172810
oiI5cAAVC8 -0.254107  2.464075 -0.268602 -0.888124
okGXRZoAGj -1.143793       NaN  0.218049  0.739344
t705PgXmUB       NaN  0.541581 -3.252222 -1.726046
bg0pMEMN5V -0.806484 -0.317136 -0.970440       NaN
A8sBQrgoYy  0.846837 -1.972895  0.363363  1.026559
fNcXiPEpda  0.322503 -0.896703  1.131578 -1.139581
9ZfrBBVS1b  0.965502  1.071220 -0.793129  1.030928
nKCTFNVQJn  0.378294 -0.195082 -0.696471  0.164374
09Dhgd6EUo  0.536019 -0.712448 -0.931603 -0.764327
boPlKmuofI  0.845718 -0.758496  0.404268 -0.048089
qkdmJbFcRx       NaN -1.425757  1.311483  0.400489
CDyUYE60Mr  1.284076  0.097904  1.210493 -0.419946
DCKIY2NpXB  0.776893 -0.882329 -0.253655  0.453915

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03  0.847874  1.443468 -0.213288 -0.210193
2000-01-04 -0.709786  0.463575  0.196696 -0.933743
2000-01-05  1.066422 -1.088918  1.130951  0.466945
2000-01-06  1.678104 -0.662641 -0.677089 -0.366829
2000-01-07  0.140045 -1.373509 -0.241661 -0.133337
2000-01-10 -1.305045 -0.615412  0.156213  0.262975
2000-01-11 -0.868759  1.767366  1.111499  1.162884
2000-01-12 -1.378776 -0.869967 -0.489820 -1.425624
2000-01-13  0.999685 -0.145505  0.795694  0.449223
2000-01-14 -0.060077  0.737633  1.481204 -0.556794
2000-01-17  1.985337 -0.006810  0.011286  0.566207
2000-01-18  0.791146  0.657422 -1.437874  0.485177
2000-01-19 -0.203149  0.253839  2.326532 -0.020875
2000-01-20  2.189291  0.871385 -0.345348 -0.135949
2000-01-21  1.981585  2.201095  0.816270 -0.033063
2000-01-24 -0.628696 -0.650876  0.538176  2.408030
2000-01-25  0.754268  0.339278 -0.315275  0.231177
2000-01-26 -1.405430  0.402651 -0.563769  0.069049
2000-01-27  0.417685  0.414184  0.483430  1.737820
2000-01-28  0.089433 -0.387274 -0.603024 -1.046186
2000-01-31  1.703135 -0.120041 -0.637101  1.135508
2000-02-01 -0.932764  1.223889 -0.758550 -1.251850
2000-02-02  0.411094  0.162473  0.526626 -0.813142
2000-02-03 -1.387100 -0.187020  1.925855  1.539692
2000-02-04 -0.970561 -0.985226 -2.264275 -0.737033
2000-02-07 -1.924764  0.518551 -1.105671 -0.277005
2000-02-08 -1.799463 -1.314836  0.292215  1.254500
2000-02-09 -0.014006 -0.098128  1.387943 -0.791060
2000-02-10 -0.061993  1.499790 -1.043824  0.080943
2000-02-11 -0.369676 -0.321135 -0.394192  0.496963

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

### 74. Write a Pandas program to fill missing values in time series data.

In [282]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
print("Original DataFrame:")
print(df)
print("\nDataFrame after interpolate:")
print(df.interpolate())

Original DataFrame:
               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5

DataFrame after interpolate:
               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

### 75. Write a Pandas program to use a local variable within a query.

In [283]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
maxx = df["W"].max()
print("\nValues which are less than maximum value of 'W' column")
print(df.query("W < @maxx"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Values which are less than maximum value of 'W' column
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

### 76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [285]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print("Original dataframe:")
print(df)
print("\nData Types:")
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
print(df["purchase"].apply(type))
df

Original dataframe:
  agent  purchase
0  a001      4500
1  a002      7500
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

### 77. Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a dataframe.

In [286]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
label1, unique1 = pd.factorize(df['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print(label1)
print(unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

### 78. Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [287]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
print("Original DataFrame:")
print(df1)
df1['rnum']=df1.rnum.where(df1.rnum.eq(df1.rnum.cummax()),0)
print("\nReplace current value in a dataframe column based on last largest value:")
print(df1)

Original DataFrame:
    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

Replace current value in a dataframe column based on last largest value:
    rnum
0     23
1      0
2     27
3      0
4     34
5      0
6     34
7      0
8      0
9      0
10    34
11     0
12     0
13     0
14     0

### 79. Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet).

In [290]:
df = pd.read_clipboard()
print("Data from clipboard to DataFrame:")
print(df)

Data from clipboard to DataFrame:
Empty DataFrame
Columns: [dataframeimage]
Index: []

### 80. Write a Pandas program to check for inequality of two given DataFrames.

In [291]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrames:")
print(df1)
print(df2)
print("\nCheck for inequality of the said dataframes:")
print(df1.ne(df2))

Original DataFrames:
      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  85.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  83  72
4   NaN  86.0  86  83
      W   X   Y   Z
0  78.0  78  84  86
1  75.0  85  84  97
2  86.0  96  89  96
3  80.0  80  83  72
4   NaN  76  86  83

Check for inequality of the said dataframes:
       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

### 81. Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [292]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nLowest n records within each group of a DataFrame:")
df1 = df.nsmallest(3, 'col1')
print(df1)
df2 = df.nsmallest(3, 'col2')
print(df2)
df3 = df.nsmallest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

Lowest n records within each group of a DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7